In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [3]:
#read excel file
df = pd.read_excel('weather_data.xlsx')
df #the indexes here are 0,1,2,3,4,5

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
#for every data frame, pd creates an index column starting from 0, by default row numbers are default indexes

In [5]:
#write to a csv file
df.to_csv('new.csv') #stores the index

df.to_csv('new_noindex.csv', index=False)

In [6]:
df.to_excel('new.xlsx',sheet_name="weather_data")

In [7]:
#Group by

In [8]:
df = pd.read_csv("weather_data_cities.csv")
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [9]:
#it groups all of the rows by citynames and makes groups for differnt cities
g = df.groupby("city")
g

In [10]:
#for each city there is a grouped df created
#indices are intact, index is not equal to the row no
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [11]:
#get a specific group
g.get_group("new york")

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [12]:
#find max temp, windspeed (numerical values) in each of the cities
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [13]:
#find the avg (of numerical attributes) temp, windspeed in each city
g.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [14]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [15]:
#Concatenate dataframes

In [16]:
#create df using dictionary
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","bangalore"],
    "temperature": [32,45,30],
    "humidity": [80,60,78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [17]:
#create df using dictionary
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68,65,75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [18]:
#concatenate 2 df
df = pd.concat([india_weather, us_weather]) #copies indices of both dfs
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

In [20]:
df = pd.concat([india_weather, us_weather], ignore_index=True) #continous index
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [21]:
df = pd.concat([india_weather, us_weather]
, axis=1) #continous index, row wise concat
df

           0   1   2         3   4   5
0     mumbai  32  80  new york  21  68
1      delhi  45  60   chicago  14  65
2  bangalore  30  78   orlando  35  75

In [22]:
#Merging df (Join command in sql, which merges tables based on common columns)

In [23]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","bangalore","hyderabad"],
    "temperature": [32,45,30,40],
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30
3  hyderabad           40

In [25]:
humidity_df = pd.DataFrame({
    "city": ["mumbai","delhi","bangalore"],
    "humidity": [68,65,75],
})
humidity_df

        city  humidity
0     mumbai        68
1      delhi        65
2  bangalore        75

In [26]:
#merge 2 df on city, drops the missing values which are not found in both the tables
df = pd.merge(temperature_df, humidity_df, on="city")
df

        city  temperature  humidity
0     mumbai           32        68
1      delhi           45        65
2  bangalore           30        75

In [27]:
#outer join, shows values of both tables, where value not found it says NaN
df = pd.merge(temperature_df, humidity_df, how="outer")
df

        city  temperature  humidity
0     mumbai           32      68.0
1      delhi           45      65.0
2  bangalore           30      75.0
3  hyderabad           40       NaN

In [28]:
#inner join (only common city names in both tables)
df = pd.merge(temperature_df, humidity_df, how="inner")
df

        city  temperature  humidity
0     mumbai           32        68
1      delhi           45        65
2  bangalore           30        75

In [29]:
#left join
df = pd.merge(temperature_df, humidity_df, how="left")
df

        city  temperature  humidity
0     mumbai           32      68.0
1      delhi           45      65.0
2  bangalore           30      75.0
3  hyderabad           40       NaN

In [30]:
#right join
df = pd.merge(temperature_df, humidity_df, how="right")
df

        city  temperature  humidity
0     mumbai           32        68
1      delhi           45        65
2  bangalore           30        75

In [31]:
#Numerical Indexing(loc (location) vs iloc(index location))
#loc uses index to fetch data: index can be default or custom generated
#iloc uses row no to fetch data: rows always start from 0
#by default index=row no, therefore loc and iloc will give the same result

In [32]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19])#using default index
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  19

In [33]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45,1,2,3,4,5]) #creating our own index
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [ ]:
#Two ways to access custom indexed data
1. get the data which has the index 46
2. get the data whose row number is 3

In [35]:
df.loc[46] #using index to access data

0    4
Name: 46, dtype: int64

In [38]:
df.iloc[3] #using row no to access data

0    4
Name: 46, dtype: int64

In [39]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [40]:
df.iloc[45]

IndexError: single positional indexer is out-of-bounds

In [41]:
df.loc[:2]  #get all of the rows till index 2, goes line by line

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [42]:
df.iloc[:2] #get rows upto 2 ie 0th and 1st row

    0
49  1
48  2